HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** \\brief  1188, Source Event Flag Register, Group */
#define VADC_G3_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0021188u)

/** Alias (User Manual Name) for VADC_G3_SEFLAG.
* To use register names with standard convension, please use VADC_G3_SEFLAG.
*/
#define	VADC_G3SEFLAG	(VADC_G3_SEFLAG)

/** \\brief  11C0, Source Event Node Pointer Register, Group */
#define VADC_G3_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00211C0u)

/** Alias (User Manual Name) for VADC_G3_SEVNP.
* To use register names with standard convension, please use VADC_G3_SEVNP.
*/
#define	VADC_G3SEVNP	(VADC_G3_SEVNP)

/** \\brief  11C8, Service Request Software Activation Trigger, Group */
#define VADC_G3_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00211C8u)

/** Alias (User Manual Name) for VADC_G3_SRACT.
* To use register names with standard convension, please use VADC_G3_SRACT.
*/
#define	VADC_G3SRACT	(VADC_G3_SRACT)

/** \\brief  10C0, Synchronization Control Register, Group */
#define VADC_G3_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00210C0u)

/** Alias (User Manual Name) for VADC_G3_SYNCTR.
* To use register names with standard convension, please use VADC_G3_SYNCTR.
*/
#define	VADC_G3SYNCTR	(VADC_G3_SYNCTR)

/** \\brief  11F8, Valid Flag Register, Group */
#define VADC_G3_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00211F8u)

/** Alias (User Manual Name) for VADC_G3_VFR.
* To use register names with standard convension, please use VADC_G3_VFR.
*/
#define	VADC_G3VFR	(VADC_G3_VFR)

/** \\brief  14B0, Alias Register, Group */
#define VADC_G4_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00214B0u)

/** Alias (User Manual Name) for VADC_G4_ALIAS.
* To use register names with standard convension, please use VADC_G4_ALIAS.
*/
#define	VADC_G4ALIAS	(VADC_G4_ALIAS)

/** \\brief  1480, Arbitration Configuration Register, Group */
#define VADC_G4_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0021480u)

/** Alias (User Manual Name) for VADC_G4_ARBCFG.
* To use register names with standard convension, please use VADC_G4_ARBCFG.
*/
#define	VADC_G4ARBCFG	(VADC_G4_ARBCFG)

/** \\brief  1484, Arbitration Priority Register, Group */
#define VADC_G4_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0021484u)

/** Alias (User Manual Name) for VADC_G4_ARBPR.
* To use register names with standard convension, please use VADC_G4_ARBPR.
*/
#define	VADC_G4ARBPR	(VADC_G4_ARBPR)

/** \\brief  1520, Autoscan Source Control Register, Group */
#define VADC_G4_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0021520u)

/** Alias (User Manual Name) for VADC_G4_ASCTRL.
* To use register names with standard convension, please use VADC_G4_ASCTRL.
*/
#define	VADC_G4ASCTRL	(VADC_G4_ASCTRL)

/** \\brief  1524, Autoscan Source Mode Register, Group */
#define VADC_G4_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0021524u)

/** Alias (User Manual Name) for VADC_G4_ASMR.
* To use register names with standard convension, please use VADC_G4_ASMR.
*/
#define	VADC_G4ASMR	(VADC_G4_ASMR)

/** \\brief  152C, Autoscan Source Pending Register, Group */
#define VADC_G4_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002152Cu)

/** Alias (User Manual Name) for VADC_G4_ASPND.
* To use register names with standard convension, please use VADC_G4_ASPND.
*/
#define	VADC_G4ASPND	(VADC_G4_ASPND)

/** \\brief  1528, Autoscan Source Channel Select Register, Group */
#define VADC_G4_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0021528u)

/** Alias (User Manual Name) for VADC_G4_ASSEL.
* To use register names with standard convension, please use VADC_G4_ASSEL.
*/
#define	VADC_G4ASSEL	(VADC_G4_ASSEL)

/** \\brief  14C8, Boundary Flag Register, Group */
#define VADC_G4_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00214C8u)

/** Alias (User Manual Name) for VADC_G4_BFL.
* To use register names with standard convension, please use VADC_G4_BFL.
*/
#define	VADC_G4BFL	(VADC_G4_BFL)

/** \\brief  14D0, Boundary Flag Control Register, Group */
#define VADC_G4_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00214D0u)

/** Alias (User Manual Name) for VADC_G4_BFLC.
* To use register names with standard convension, please use VADC_G4_BFLC.
*/
#define	VADC_G4BFLC	(VADC_G4_BFLC)

/** \\brief  14CC, Boundary Flag Software Register, Group */
#define VADC_G4_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00214CCu)

/** Alias (User Manual Name) for VADC_G4_BFLS.
* To use register names with standard convension, please use VADC_G4_BFLS.
*/
#define	VADC_G4BFLS	(VADC_G4_BFLS)

/** \\brief  14B8, Boundary Select Register, Group */
#define VADC_G4_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00214B8u)

/** Alias (User Manual Name) for VADC_G4_BOUND.
* To use register names with standard convension, please use VADC_G4_BOUND.
*/
#define	VADC_G4BOUND	(VADC_G4_BOUND)

/** \\brief  1590, Channel Event Flag Clear Register, Group */
#define VADC_G4_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0021590u)

/** Alias (User Manual Name) for VADC_G4_CEFCLR.
* To use register names with standard convension, please use VADC_G4_CEFCLR.
*/
#define	VADC_G4CEFCLR	(VADC_G4_CEFCLR)

/** \\brief  1580, Channel Event Flag Register, Group */
#define VADC_G4_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0021580u)

/** Alias (User Manual Name) for VADC_G4_CEFLAG.
* To use register names with standard convension, please use VADC_G4_CEFLAG.
*/
#define	VADC_G4CEFLAG	(VADC_G4_CEFLAG)

/** \\brief  15A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G4_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00215A0u)

/** Alias (User Manual Name) for VADC_G4_CEVNP0.
* To use register names with standard convension, please use VADC_G4_CEVNP0.
*/
#define	VADC_G4CEVNP0	(VADC_G4_CEVNP0)

/** \\brief  1488, Channel Assignment Register, Group */
#define VADC_G4_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0021488u)

