HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G4_CHASS.
* To use register names with standard convension, please use VADC_G4_CHASS.
*/
#define	VADC_G4CHASS	(VADC_G4_CHASS)

/** \\brief  1600, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021600u)

/** Alias (User Manual Name) for VADC_G4_CHCTR0.
* To use register names with standard convension, please use VADC_G4_CHCTR0.
*/
#define	VADC_G4CHCTR0	(VADC_G4_CHCTR0)

/** \\brief  1604, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021604u)

/** Alias (User Manual Name) for VADC_G4_CHCTR1.
* To use register names with standard convension, please use VADC_G4_CHCTR1.
*/
#define	VADC_G4CHCTR1	(VADC_G4_CHCTR1)







/** \\brief  1608, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021608u)

/** Alias (User Manual Name) for VADC_G4_CHCTR2.
* To use register names with standard convension, please use VADC_G4_CHCTR2.
*/
#define	VADC_G4CHCTR2	(VADC_G4_CHCTR2)

/** \\brief  160C, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002160Cu)

/** Alias (User Manual Name) for VADC_G4_CHCTR3.
* To use register names with standard convension, please use VADC_G4_CHCTR3.
*/
#define	VADC_G4CHCTR3	(VADC_G4_CHCTR3)

/** \\brief  1610, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021610u)

/** Alias (User Manual Name) for VADC_G4_CHCTR4.
* To use register names with standard convension, please use VADC_G4_CHCTR4.
*/
#define	VADC_G4CHCTR4	(VADC_G4_CHCTR4)

/** \\brief  1614, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021614u)

/** Alias (User Manual Name) for VADC_G4_CHCTR5.
* To use register names with standard convension, please use VADC_G4_CHCTR5.
*/
#define	VADC_G4CHCTR5	(VADC_G4_CHCTR5)

/** \\brief  1618, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021618u)

/** Alias (User Manual Name) for VADC_G4_CHCTR6.
* To use register names with standard convension, please use VADC_G4_CHCTR6.
*/
#define	VADC_G4CHCTR6	(VADC_G4_CHCTR6)

/** \\brief  161C, Group, Channel Ctrl. Reg. */
#define VADC_G4_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002161Cu)

/** Alias (User Manual Name) for VADC_G4_CHCTR7.
* To use register names with standard convension, please use VADC_G4_CHCTR7.
*/
#define	VADC_G4CHCTR7	(VADC_G4_CHCTR7)



/** \\brief  15F0, External Multiplexer Control Register, Group x */
#define VADC_G4_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00215F0u)

/** Alias (User Manual Name) for VADC_G4_EMUXCTR.
* To use register names with standard convension, please use VADC_G4_EMUXCTR.
*/
#define	VADC_G4EMUXCTR	(VADC_G4_EMUXCTR)

/** \\brief  14A0, Input Class Register */
#define VADC_G4_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00214A0u)

/** Alias (User Manual Name) for VADC_G4_ICLASS0.
* To use register names with standard convension, please use VADC_G4_ICLASS0.
*/
#define	VADC_G4ICLASS0	(VADC_G4_ICLASS0)

/** \\brief  14A4, Input Class Register */
#define VADC_G4_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00214A4u)

/** Alias (User Manual Name) for VADC_G4_ICLASS1.
* To use register names with standard convension, please use VADC_G4_ICLASS1.
*/
#define	VADC_G4ICLASS1	(VADC_G4_ICLASS1)

/** \\brief  150C, Queue 0 Register 0, Group */
#define VADC_G4_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002150Cu)

/** Alias (User Manual Name) for VADC_G4_Q0R0.
* To use register names with standard convension, please use VADC_G4_Q0R0.
*/
#define	VADC_G4Q0R0	(VADC_G4_Q0R0)

/** \\brief  1510, Queue 0 Input Register, Group */
#define VADC_G4_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0021510u)

/** Alias (User Manual Name) for VADC_G4_QBUR0.
* To use register names with standard convension, please use VADC_G4_QBUR0.
*/
#define	VADC_G4QBUR0	(VADC_G4_QBUR0)

/** \\brief  1500, Queue 0 Source Control Register, Group */
#define VADC_G4_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0021500u)

/** Alias (User Manual Name) for VADC_G4_QCTRL0.
* To use register names with standard convension, please use VADC_G4_QCTRL0.
*/
#define	VADC_G4QCTRL0	(VADC_G4_QCTRL0)

/** \\brief  1510, Queue 0 Input Register, Group */
#define VADC_G4_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0021510u)

/** Alias (User Manual Name) for VADC_G4_QINR0.
* To use register names with standard convension, please use VADC_G4_QINR0.
*/
#define	VADC_G4QINR0	(VADC_G4_QINR0)

/** \\brief  1504, Queue 0 Mode Register, Group */
#define VADC_G4_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0021504u)

/** Alias (User Manual Name) for VADC_G4_QMR0.
* To use register names with standard convension, please use VADC_G4_QMR0.
*/
#define	VADC_G4QMR0	(VADC_G4_QMR0)

/** \\brief  1508, Queue 0 Status Register, Group */
#define VADC_G4_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0021508u)

/** Alias (User Manual Name) for VADC_G4_QSR0.
* To use register names with standard convension, please use VADC_G4_QSR0.
*/
#define	VADC_G4QSR0	(VADC_G4_QSR0)

/** \\brief  1680, Group Result Control Reg. */
#define VADC_G4_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021680u)

/** Alias (User Manual Name) for VADC_G4_RCR0.
* To use register names with standard convension, please use VADC_G4_RCR0.
*/
#define	VADC_G4RCR0	(VADC_G4_RCR0)

/** \\brief  1684, Group Result Control Reg. */
#define VADC_G4_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021684u)

/** Alias (User Manual Name) for VADC_G4_RCR1.
* To use register names with standard convension, please use VADC_G4_RCR1.
*/
#define	VADC_G4RCR1	(VADC_G4_RCR1)

/** \\brief  16A8, Group Result Control Reg. */
#define VADC_G4_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216A8u)

