HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G4_RCR10.
* To use register names with standard convension, please use VADC_G4_RCR10.
*/
#define	VADC_G4RCR10	(VADC_G4_RCR10)

/** \\brief  16AC, Group Result Control Reg. */
#define VADC_G4_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216ACu)

/** Alias (User Manual Name) for VADC_G4_RCR11.
* To use register names with standard convension, please use VADC_G4_RCR11.
*/
#define	VADC_G4RCR11	(VADC_G4_RCR11)

/** \\brief  16B0, Group Result Control Reg. */
#define VADC_G4_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216B0u)

/** Alias (User Manual Name) for VADC_G4_RCR12.
* To use register names with standard convension, please use VADC_G4_RCR12.
*/
#define	VADC_G4RCR12	(VADC_G4_RCR12)

/** \\brief  16B4, Group Result Control Reg. */
#define VADC_G4_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216B4u)

/** Alias (User Manual Name) for VADC_G4_RCR13.
* To use register names with standard convension, please use VADC_G4_RCR13.
*/
#define	VADC_G4RCR13	(VADC_G4_RCR13)

/** \\brief  16B8, Group Result Control Reg. */
#define VADC_G4_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216B8u)

/** Alias (User Manual Name) for VADC_G4_RCR14.
* To use register names with standard convension, please use VADC_G4_RCR14.
*/
#define	VADC_G4RCR14	(VADC_G4_RCR14)

/** \\brief  16BC, Group Result Control Reg. */
#define VADC_G4_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216BCu)

/** Alias (User Manual Name) for VADC_G4_RCR15.
* To use register names with standard convension, please use VADC_G4_RCR15.
*/
#define	VADC_G4RCR15	(VADC_G4_RCR15)

/** \\brief  1688, Group Result Control Reg. */
#define VADC_G4_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021688u)

/** Alias (User Manual Name) for VADC_G4_RCR2.
* To use register names with standard convension, please use VADC_G4_RCR2.
*/
#define	VADC_G4RCR2	(VADC_G4_RCR2)

/** \\brief  168C, Group Result Control Reg. */
#define VADC_G4_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF002168Cu)

/** Alias (User Manual Name) for VADC_G4_RCR3.
* To use register names with standard convension, please use VADC_G4_RCR3.
*/
#define	VADC_G4RCR3	(VADC_G4_RCR3)

/** \\brief  1690, Group Result Control Reg. */
#define VADC_G4_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021690u)

/** Alias (User Manual Name) for VADC_G4_RCR4.
* To use register names with standard convension, please use VADC_G4_RCR4.
*/
#define	VADC_G4RCR4	(VADC_G4_RCR4)

/** \\brief  1694, Group Result Control Reg. */
#define VADC_G4_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021694u)

/** Alias (User Manual Name) for VADC_G4_RCR5.
* To use register names with standard convension, please use VADC_G4_RCR5.
*/
#define	VADC_G4RCR5	(VADC_G4_RCR5)

/** \\brief  1698, Group Result Control Reg. */
#define VADC_G4_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021698u)

/** Alias (User Manual Name) for VADC_G4_RCR6.
* To use register names with standard convension, please use VADC_G4_RCR6.
*/
#define	VADC_G4RCR6	(VADC_G4_RCR6)

/** \\brief  169C, Group Result Control Reg. */
#define VADC_G4_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF002169Cu)

/** Alias (User Manual Name) for VADC_G4_RCR7.
* To use register names with standard convension, please use VADC_G4_RCR7.
*/
#define	VADC_G4RCR7	(VADC_G4_RCR7)

/** \\brief  16A0, Group Result Control Reg. */
#define VADC_G4_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216A0u)

/** Alias (User Manual Name) for VADC_G4_RCR8.
* To use register names with standard convension, please use VADC_G4_RCR8.
*/
#define	VADC_G4RCR8	(VADC_G4_RCR8)

/** \\brief  16A4, Group Result Control Reg. */
#define VADC_G4_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF00216A4u)

/** Alias (User Manual Name) for VADC_G4_RCR9.
* To use register names with standard convension, please use VADC_G4_RCR9.
*/
#define	VADC_G4RCR9	(VADC_G4_RCR9)

/** \\brief  1594, Result Event Flag Clear Register, Group */
#define VADC_G4_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0021594u)

/** Alias (User Manual Name) for VADC_G4_REFCLR.
* To use register names with standard convension, please use VADC_G4_REFCLR.
*/
#define	VADC_G4REFCLR	(VADC_G4_REFCLR)

/** \\brief  1584, Result Event Flag Register, Group */
#define VADC_G4_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0021584u)

/** Alias (User Manual Name) for VADC_G4_REFLAG.
* To use register names with standard convension, please use VADC_G4_REFLAG.
*/
#define	VADC_G4REFLAG	(VADC_G4_REFLAG)

/** \\brief  1700, Group Result Register */
#define VADC_G4_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021700u)

/** Alias (User Manual Name) for VADC_G4_RES0.
* To use register names with standard convension, please use VADC_G4_RES0.
*/
#define	VADC_G4RES0	(VADC_G4_RES0)

/** \\brief  1704, Group Result Register */
#define VADC_G4_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021704u)

/** Alias (User Manual Name) for VADC_G4_RES1.
* To use register names with standard convension, please use VADC_G4_RES1.
*/
#define	VADC_G4RES1	(VADC_G4_RES1)

/** \\brief  1728, Group Result Register */
#define VADC_G4_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021728u)

/** Alias (User Manual Name) for VADC_G4_RES10.
* To use register names with standard convension, please use VADC_G4_RES10.
*/
#define	VADC_G4RES10	(VADC_G4_RES10)

/** \\brief  172C, Group Result Register */
#define VADC_G4_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002172Cu)

/** Alias (User Manual Name) for VADC_G4_RES11.
* To use register names with standard convension, please use VADC_G4_RES11.
*/
#define	VADC_G4RES11	(VADC_G4_RES11)

/** \\brief  1730, Group Result Register */
#define VADC_G4_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021730u)

/** Alias (User Manual Name) for VADC_G4_RES12.
* To use register names with standard convension, please use VADC_G4_RES12.
*/
#define	VADC_G4RES12	(VADC_G4_RES12)

/** \\brief  1734, Group Result Register */
#define VADC_G4_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021734u)

/** Alias (User Manual Name) for VADC_G4_RES13.
* To use register names with standard convension, please use VADC_G4_RES13.
*/
#define	VADC_G4RES13	(VADC_G4_RES13)

/** \\brief  1738, Group Result Register */
#define VADC_G4_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021738u)

/** Alias (User Manual Name) for VADC_G4_RES14.
* To use register names with standard convension, please use VADC_G4_RES14.
*/
#define	VADC_G4RES14	(VADC_G4_RES14)

/** \\brief  173C, Group Result Register */
#define VADC_G4_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002173Cu)

