HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G4_RESD6.
* To use register names with standard convension, please use VADC_G4_RESD6.
*/
#define	VADC_G4RESD6	(VADC_G4_RESD6)

/** \\brief  179C, Group Result Reg., Debug */
#define VADC_G4_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF002179Cu)

/** Alias (User Manual Name) for VADC_G4_RESD7.
* To use register names with standard convension, please use VADC_G4_RESD7.
*/
#define	VADC_G4RESD7	(VADC_G4_RESD7)

/** \\brief  17A0, Group Result Reg., Debug */
#define VADC_G4_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00217A0u)

/** Alias (User Manual Name) for VADC_G4_RESD8.
* To use register names with standard convension, please use VADC_G4_RESD8.
*/
#define	VADC_G4RESD8	(VADC_G4_RESD8)

/** \\brief  17A4, Group Result Reg., Debug */
#define VADC_G4_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00217A4u)

/** Alias (User Manual Name) for VADC_G4_RESD9.
* To use register names with standard convension, please use VADC_G4_RESD9.
*/
#define	VADC_G4RESD9	(VADC_G4_RESD9)

/** \\brief  15B0, Result Event Node Pointer Register 0, Group */
#define VADC_G4_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00215B0u)

/** Alias (User Manual Name) for VADC_G4_REVNP0.
* To use register names with standard convension, please use VADC_G4_REVNP0.
*/
#define	VADC_G4REVNP0	(VADC_G4_REVNP0)

/** \\brief  15B4, Result Event Node Pointer Register 1, Group */
#define VADC_G4_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00215B4u)

/** Alias (User Manual Name) for VADC_G4_REVNP1.
* To use register names with standard convension, please use VADC_G4_REVNP1.
*/
#define	VADC_G4REVNP1	(VADC_G4_REVNP1)

/** \\brief  1598, Source Event Flag Clear Register, Group */
#define VADC_G4_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0021598u)

/** Alias (User Manual Name) for VADC_G4_SEFCLR.
* To use register names with standard convension, please use VADC_G4_SEFCLR.
*/
#define	VADC_G4SEFCLR	(VADC_G4_SEFCLR)

/** \\brief  1588, Source Event Flag Register, Group */
#define VADC_G4_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0021588u)

/** Alias (User Manual Name) for VADC_G4_SEFLAG.
* To use register names with standard convension, please use VADC_G4_SEFLAG.
*/
#define	VADC_G4SEFLAG	(VADC_G4_SEFLAG)

/** \\brief  15C0, Source Event Node Pointer Register, Group */
#define VADC_G4_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00215C0u)

/** Alias (User Manual Name) for VADC_G4_SEVNP.
* To use register names with standard convension, please use VADC_G4_SEVNP.
*/
#define	VADC_G4SEVNP	(VADC_G4_SEVNP)

/** \\brief  15C8, Service Request Software Activation Trigger, Group */
#define VADC_G4_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00215C8u)

/** Alias (User Manual Name) for VADC_G4_SRACT.
* To use register names with standard convension, please use VADC_G4_SRACT.
*/
#define	VADC_G4SRACT	(VADC_G4_SRACT)

/** \\brief  14C0, Synchronization Control Register, Group */
#define VADC_G4_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00214C0u)

/** Alias (User Manual Name) for VADC_G4_SYNCTR.
* To use register names with standard convension, please use VADC_G4_SYNCTR.
*/
#define	VADC_G4SYNCTR	(VADC_G4_SYNCTR)

/** \\brief  15F8, Valid Flag Register, Group */
#define VADC_G4_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00215F8u)

/** Alias (User Manual Name) for VADC_G4_VFR.
* To use register names with standard convension, please use VADC_G4_VFR.
*/
#define	VADC_G4VFR	(VADC_G4_VFR)

/** \\brief  18B0, Alias Register, Group */
#define VADC_G5_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00218B0u)

/** Alias (User Manual Name) for VADC_G5_ALIAS.
* To use register names with standard convension, please use VADC_G5_ALIAS.
*/
#define	VADC_G5ALIAS	(VADC_G5_ALIAS)

/** \\brief  1880, Arbitration Configuration Register, Group */
#define VADC_G5_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0021880u)

/** Alias (User Manual Name) for VADC_G5_ARBCFG.
* To use register names with standard convension, please use VADC_G5_ARBCFG.
*/
#define	VADC_G5ARBCFG	(VADC_G5_ARBCFG)

/** \\brief  1884, Arbitration Priority Register, Group */
#define VADC_G5_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0021884u)

/** Alias (User Manual Name) for VADC_G5_ARBPR.
* To use register names with standard convension, please use VADC_G5_ARBPR.
*/
#define	VADC_G5ARBPR	(VADC_G5_ARBPR)

/** \\brief  1920, Autoscan Source Control Register, Group */
#define VADC_G5_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0021920u)

/** Alias (User Manual Name) for VADC_G5_ASCTRL.
* To use register names with standard convension, please use VADC_G5_ASCTRL.
*/
#define	VADC_G5ASCTRL	(VADC_G5_ASCTRL)

/** \\brief  1924, Autoscan Source Mode Register, Group */
#define VADC_G5_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0021924u)

/** Alias (User Manual Name) for VADC_G5_ASMR.
* To use register names with standard convension, please use VADC_G5_ASMR.
*/
#define	VADC_G5ASMR	(VADC_G5_ASMR)

/** \\brief  192C, Autoscan Source Pending Register, Group */
#define VADC_G5_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002192Cu)

/** Alias (User Manual Name) for VADC_G5_ASPND.
* To use register names with standard convension, please use VADC_G5_ASPND.
*/
#define	VADC_G5ASPND	(VADC_G5_ASPND)

/** \\brief  1928, Autoscan Source Channel Select Register, Group */
#define VADC_G5_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0021928u)

/** Alias (User Manual Name) for VADC_G5_ASSEL.
* To use register names with standard convension, please use VADC_G5_ASSEL.
*/
#define	VADC_G5ASSEL	(VADC_G5_ASSEL)

/** \\brief  18C8, Boundary Flag Register, Group */
#define VADC_G5_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00218C8u)

/** Alias (User Manual Name) for VADC_G5_BFL.
* To use register names with standard convension, please use VADC_G5_BFL.
*/
#define	VADC_G5BFL	(VADC_G5_BFL)

/** \\brief  18D0, Boundary Flag Control Register, Group */
#define VADC_G5_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00218D0u)

