HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G5_BFLC.
* To use register names with standard convension, please use VADC_G5_BFLC.
*/
#define	VADC_G5BFLC	(VADC_G5_BFLC)

/** \\brief  18CC, Boundary Flag Software Register, Group */
#define VADC_G5_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00218CCu)

/** Alias (User Manual Name) for VADC_G5_BFLS.
* To use register names with standard convension, please use VADC_G5_BFLS.
*/
#define	VADC_G5BFLS	(VADC_G5_BFLS)

/** \\brief  18B8, Boundary Select Register, Group */
#define VADC_G5_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00218B8u)

/** Alias (User Manual Name) for VADC_G5_BOUND.
* To use register names with standard convension, please use VADC_G5_BOUND.
*/
#define	VADC_G5BOUND	(VADC_G5_BOUND)

/** \\brief  1990, Channel Event Flag Clear Register, Group */
#define VADC_G5_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0021990u)

/** Alias (User Manual Name) for VADC_G5_CEFCLR.
* To use register names with standard convension, please use VADC_G5_CEFCLR.
*/
#define	VADC_G5CEFCLR	(VADC_G5_CEFCLR)

/** \\brief  1980, Channel Event Flag Register, Group */
#define VADC_G5_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0021980u)

/** Alias (User Manual Name) for VADC_G5_CEFLAG.
* To use register names with standard convension, please use VADC_G5_CEFLAG.
*/
#define	VADC_G5CEFLAG	(VADC_G5_CEFLAG)

/** \\brief  19A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G5_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00219A0u)

/** Alias (User Manual Name) for VADC_G5_CEVNP0.
* To use register names with standard convension, please use VADC_G5_CEVNP0.
*/
#define	VADC_G5CEVNP0	(VADC_G5_CEVNP0)

/** \\brief  1888, Channel Assignment Register, Group */
#define VADC_G5_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0021888u)

/** Alias (User Manual Name) for VADC_G5_CHASS.
* To use register names with standard convension, please use VADC_G5_CHASS.
*/
#define	VADC_G5CHASS	(VADC_G5_CHASS)

/** \\brief  1A00, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A00u)

/** Alias (User Manual Name) for VADC_G5_CHCTR0.
* To use register names with standard convension, please use VADC_G5_CHCTR0.
*/
#define	VADC_G5CHCTR0	(VADC_G5_CHCTR0)

/** \\brief  1A04, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A04u)

/** Alias (User Manual Name) for VADC_G5_CHCTR1.
* To use register names with standard convension, please use VADC_G5_CHCTR1.
*/
#define	VADC_G5CHCTR1	(VADC_G5_CHCTR1)







/** \\brief  1A08, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A08u)

/** Alias (User Manual Name) for VADC_G5_CHCTR2.
* To use register names with standard convension, please use VADC_G5_CHCTR2.
*/
#define	VADC_G5CHCTR2	(VADC_G5_CHCTR2)

/** \\brief  1A0C, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A0Cu)

/** Alias (User Manual Name) for VADC_G5_CHCTR3.
* To use register names with standard convension, please use VADC_G5_CHCTR3.
*/
#define	VADC_G5CHCTR3	(VADC_G5_CHCTR3)

/** \\brief  1A10, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A10u)

/** Alias (User Manual Name) for VADC_G5_CHCTR4.
* To use register names with standard convension, please use VADC_G5_CHCTR4.
*/
#define	VADC_G5CHCTR4	(VADC_G5_CHCTR4)

/** \\brief  1A14, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A14u)

/** Alias (User Manual Name) for VADC_G5_CHCTR5.
* To use register names with standard convension, please use VADC_G5_CHCTR5.
*/
#define	VADC_G5CHCTR5	(VADC_G5_CHCTR5)

/** \\brief  1A18, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A18u)

/** Alias (User Manual Name) for VADC_G5_CHCTR6.
* To use register names with standard convension, please use VADC_G5_CHCTR6.
*/
#define	VADC_G5CHCTR6	(VADC_G5_CHCTR6)

/** \\brief  1A1C, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021A1Cu)

/** Alias (User Manual Name) for VADC_G5_CHCTR7.
* To use register names with standard convension, please use VADC_G5_CHCTR7.
*/
#define	VADC_G5CHCTR7	(VADC_G5_CHCTR7)



/** \\brief  19F0, External Multiplexer Control Register, Group x */
#define VADC_G5_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00219F0u)

/** Alias (User Manual Name) for VADC_G5_EMUXCTR.
* To use register names with standard convension, please use VADC_G5_EMUXCTR.
*/
#define	VADC_G5EMUXCTR	(VADC_G5_EMUXCTR)

/** \\brief  18A0, Input Class Register */
#define VADC_G5_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00218A0u)

/** Alias (User Manual Name) for VADC_G5_ICLASS0.
* To use register names with standard convension, please use VADC_G5_ICLASS0.
*/
#define	VADC_G5ICLASS0	(VADC_G5_ICLASS0)

/** \\brief  18A4, Input Class Register */
#define VADC_G5_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00218A4u)

/** Alias (User Manual Name) for VADC_G5_ICLASS1.
* To use register names with standard convension, please use VADC_G5_ICLASS1.
*/
#define	VADC_G5ICLASS1	(VADC_G5_ICLASS1)

/** \\brief  190C, Queue 0 Register 0, Group */
#define VADC_G5_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002190Cu)

/** Alias (User Manual Name) for VADC_G5_Q0R0.
* To use register names with standard convension, please use VADC_G5_Q0R0.
*/
#define	VADC_G5Q0R0	(VADC_G5_Q0R0)

/** \\brief  1910, Queue 0 Input Register, Group */
#define VADC_G5_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0021910u)

/** Alias (User Manual Name) for VADC_G5_QBUR0.
* To use register names with standard convension, please use VADC_G5_QBUR0.
*/
#define	VADC_G5QBUR0	(VADC_G5_QBUR0)

/** \\brief  1900, Queue 0 Source Control Register, Group */
#define VADC_G5_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0021900u)

/** Alias (User Manual Name) for VADC_G5_QCTRL0.
* To use register names with standard convension, please use VADC_G5_QCTRL0.
*/
#define	VADC_G5QCTRL0	(VADC_G5_QCTRL0)

/** \\brief  1910, Queue 0 Input Register, Group */
#define VADC_G5_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0021910u)

/** Alias (User Manual Name) for VADC_G5_QINR0.
* To use register names with standard convension, please use VADC_G5_QINR0.
*/
#define	VADC_G5QINR0	(VADC_G5_QINR0)

