HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** \\brief  1904, Queue 0 Mode Register, Group */
#define VADC_G5_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0021904u)

/** Alias (User Manual Name) for VADC_G5_QMR0.
* To use register names with standard convension, please use VADC_G5_QMR0.
*/
#define	VADC_G5QMR0	(VADC_G5_QMR0)

/** \\brief  1908, Queue 0 Status Register, Group */
#define VADC_G5_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0021908u)

/** Alias (User Manual Name) for VADC_G5_QSR0.
* To use register names with standard convension, please use VADC_G5_QSR0.
*/
#define	VADC_G5QSR0	(VADC_G5_QSR0)

/** \\brief  1A80, Group Result Control Reg. */
#define VADC_G5_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A80u)

/** Alias (User Manual Name) for VADC_G5_RCR0.
* To use register names with standard convension, please use VADC_G5_RCR0.
*/
#define	VADC_G5RCR0	(VADC_G5_RCR0)

/** \\brief  1A84, Group Result Control Reg. */
#define VADC_G5_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A84u)

/** Alias (User Manual Name) for VADC_G5_RCR1.
* To use register names with standard convension, please use VADC_G5_RCR1.
*/
#define	VADC_G5RCR1	(VADC_G5_RCR1)

/** \\brief  1AA8, Group Result Control Reg. */
#define VADC_G5_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AA8u)

/** Alias (User Manual Name) for VADC_G5_RCR10.
* To use register names with standard convension, please use VADC_G5_RCR10.
*/
#define	VADC_G5RCR10	(VADC_G5_RCR10)

/** \\brief  1AAC, Group Result Control Reg. */
#define VADC_G5_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AACu)

/** Alias (User Manual Name) for VADC_G5_RCR11.
* To use register names with standard convension, please use VADC_G5_RCR11.
*/
#define	VADC_G5RCR11	(VADC_G5_RCR11)

/** \\brief  1AB0, Group Result Control Reg. */
#define VADC_G5_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AB0u)

/** Alias (User Manual Name) for VADC_G5_RCR12.
* To use register names with standard convension, please use VADC_G5_RCR12.
*/
#define	VADC_G5RCR12	(VADC_G5_RCR12)

/** \\brief  1AB4, Group Result Control Reg. */
#define VADC_G5_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AB4u)

/** Alias (User Manual Name) for VADC_G5_RCR13.
* To use register names with standard convension, please use VADC_G5_RCR13.
*/
#define	VADC_G5RCR13	(VADC_G5_RCR13)

/** \\brief  1AB8, Group Result Control Reg. */
#define VADC_G5_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AB8u)

/** Alias (User Manual Name) for VADC_G5_RCR14.
* To use register names with standard convension, please use VADC_G5_RCR14.
*/
#define	VADC_G5RCR14	(VADC_G5_RCR14)

/** \\brief  1ABC, Group Result Control Reg. */
#define VADC_G5_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021ABCu)

/** Alias (User Manual Name) for VADC_G5_RCR15.
* To use register names with standard convension, please use VADC_G5_RCR15.
*/
#define	VADC_G5RCR15	(VADC_G5_RCR15)

/** \\brief  1A88, Group Result Control Reg. */
#define VADC_G5_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A88u)

/** Alias (User Manual Name) for VADC_G5_RCR2.
* To use register names with standard convension, please use VADC_G5_RCR2.
*/
#define	VADC_G5RCR2	(VADC_G5_RCR2)

/** \\brief  1A8C, Group Result Control Reg. */
#define VADC_G5_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A8Cu)

/** Alias (User Manual Name) for VADC_G5_RCR3.
* To use register names with standard convension, please use VADC_G5_RCR3.
*/
#define	VADC_G5RCR3	(VADC_G5_RCR3)

/** \\brief  1A90, Group Result Control Reg. */
#define VADC_G5_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A90u)

/** Alias (User Manual Name) for VADC_G5_RCR4.
* To use register names with standard convension, please use VADC_G5_RCR4.
*/
#define	VADC_G5RCR4	(VADC_G5_RCR4)

/** \\brief  1A94, Group Result Control Reg. */
#define VADC_G5_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A94u)

/** Alias (User Manual Name) for VADC_G5_RCR5.
* To use register names with standard convension, please use VADC_G5_RCR5.
*/
#define	VADC_G5RCR5	(VADC_G5_RCR5)

/** \\brief  1A98, Group Result Control Reg. */
#define VADC_G5_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A98u)

/** Alias (User Manual Name) for VADC_G5_RCR6.
* To use register names with standard convension, please use VADC_G5_RCR6.
*/
#define	VADC_G5RCR6	(VADC_G5_RCR6)

/** \\brief  1A9C, Group Result Control Reg. */
#define VADC_G5_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021A9Cu)

/** Alias (User Manual Name) for VADC_G5_RCR7.
* To use register names with standard convension, please use VADC_G5_RCR7.
*/
#define	VADC_G5RCR7	(VADC_G5_RCR7)

/** \\brief  1AA0, Group Result Control Reg. */
#define VADC_G5_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AA0u)

/** Alias (User Manual Name) for VADC_G5_RCR8.
* To use register names with standard convension, please use VADC_G5_RCR8.
*/
#define	VADC_G5RCR8	(VADC_G5_RCR8)

/** \\brief  1AA4, Group Result Control Reg. */
#define VADC_G5_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RCR*)0xF0021AA4u)

/** Alias (User Manual Name) for VADC_G5_RCR9.
* To use register names with standard convension, please use VADC_G5_RCR9.
*/
#define	VADC_G5RCR9	(VADC_G5_RCR9)

/** \\brief  1994, Result Event Flag Clear Register, Group */
#define VADC_G5_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0021994u)

/** Alias (User Manual Name) for VADC_G5_REFCLR.
* To use register names with standard convension, please use VADC_G5_REFCLR.
*/
#define	VADC_G5REFCLR	(VADC_G5_REFCLR)

/** \\brief  1984, Result Event Flag Register, Group */
#define VADC_G5_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0021984u)

/** Alias (User Manual Name) for VADC_G5_REFLAG.
* To use register names with standard convension, please use VADC_G5_REFLAG.
*/
#define	VADC_G5REFLAG	(VADC_G5_REFLAG)

/** \\brief  1B00, Group Result Register */
#define VADC_G5_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B00u)

/** Alias (User Manual Name) for VADC_G5_RES0.
* To use register names with standard convension, please use VADC_G5_RES0.
*/
#define	VADC_G5RES0	(VADC_G5_RES0)

/** \\brief  1B04, Group Result Register */
#define VADC_G5_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B04u)

/** Alias (User Manual Name) for VADC_G5_RES1.
* To use register names with standard convension, please use VADC_G5_RES1.
*/
#define	VADC_G5RES1	(VADC_G5_RES1)

/** \\brief  1B28, Group Result Register */
#define VADC_G5_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021B28u)

/** Alias (User Manual Name) for VADC_G5_RES10.
* To use register names with standard convension, please use VADC_G5_RES10.
*/
#define	VADC_G5RES10	(VADC_G5_RES10)

