HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G5_RESD4.
* To use register names with standard convension, please use VADC_G5_RESD4.
*/
#define	VADC_G5RESD4	(VADC_G5_RESD4)

/** \\brief  1B94, Group Result Reg., Debug */
#define VADC_G5_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B94u)

/** Alias (User Manual Name) for VADC_G5_RESD5.
* To use register names with standard convension, please use VADC_G5_RESD5.
*/
#define	VADC_G5RESD5	(VADC_G5_RESD5)

/** \\brief  1B98, Group Result Reg., Debug */
#define VADC_G5_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B98u)

/** Alias (User Manual Name) for VADC_G5_RESD6.
* To use register names with standard convension, please use VADC_G5_RESD6.
*/
#define	VADC_G5RESD6	(VADC_G5_RESD6)

/** \\brief  1B9C, Group Result Reg., Debug */
#define VADC_G5_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021B9Cu)

/** Alias (User Manual Name) for VADC_G5_RESD7.
* To use register names with standard convension, please use VADC_G5_RESD7.
*/
#define	VADC_G5RESD7	(VADC_G5_RESD7)

/** \\brief  1BA0, Group Result Reg., Debug */
#define VADC_G5_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BA0u)

/** Alias (User Manual Name) for VADC_G5_RESD8.
* To use register names with standard convension, please use VADC_G5_RESD8.
*/
#define	VADC_G5RESD8	(VADC_G5_RESD8)

/** \\brief  1BA4, Group Result Reg., Debug */
#define VADC_G5_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021BA4u)

/** Alias (User Manual Name) for VADC_G5_RESD9.
* To use register names with standard convension, please use VADC_G5_RESD9.
*/
#define	VADC_G5RESD9	(VADC_G5_RESD9)

/** \\brief  19B0, Result Event Node Pointer Register 0, Group */
#define VADC_G5_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00219B0u)

/** Alias (User Manual Name) for VADC_G5_REVNP0.
* To use register names with standard convension, please use VADC_G5_REVNP0.
*/
#define	VADC_G5REVNP0	(VADC_G5_REVNP0)

/** \\brief  19B4, Result Event Node Pointer Register 1, Group */
#define VADC_G5_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00219B4u)

/** Alias (User Manual Name) for VADC_G5_REVNP1.
* To use register names with standard convension, please use VADC_G5_REVNP1.
*/
#define	VADC_G5REVNP1	(VADC_G5_REVNP1)

/** \\brief  1998, Source Event Flag Clear Register, Group */
#define VADC_G5_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0021998u)

/** Alias (User Manual Name) for VADC_G5_SEFCLR.
* To use register names with standard convension, please use VADC_G5_SEFCLR.
*/
#define	VADC_G5SEFCLR	(VADC_G5_SEFCLR)

/** \\brief  1988, Source Event Flag Register, Group */
#define VADC_G5_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0021988u)

/** Alias (User Manual Name) for VADC_G5_SEFLAG.
* To use register names with standard convension, please use VADC_G5_SEFLAG.
*/
#define	VADC_G5SEFLAG	(VADC_G5_SEFLAG)

/** \\brief  19C0, Source Event Node Pointer Register, Group */
#define VADC_G5_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00219C0u)

/** Alias (User Manual Name) for VADC_G5_SEVNP.
* To use register names with standard convension, please use VADC_G5_SEVNP.
*/
#define	VADC_G5SEVNP	(VADC_G5_SEVNP)

/** \\brief  19C8, Service Request Software Activation Trigger, Group */
#define VADC_G5_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00219C8u)

/** Alias (User Manual Name) for VADC_G5_SRACT.
* To use register names with standard convension, please use VADC_G5_SRACT.
*/
#define	VADC_G5SRACT	(VADC_G5_SRACT)

/** \\brief  18C0, Synchronization Control Register, Group */
#define VADC_G5_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00218C0u)

/** Alias (User Manual Name) for VADC_G5_SYNCTR.
* To use register names with standard convension, please use VADC_G5_SYNCTR.
*/
#define	VADC_G5SYNCTR	(VADC_G5_SYNCTR)

/** \\brief  19F8, Valid Flag Register, Group */
#define VADC_G5_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00219F8u)

/** Alias (User Manual Name) for VADC_G5_VFR.
* To use register names with standard convension, please use VADC_G5_VFR.
*/
#define	VADC_G5VFR	(VADC_G5_VFR)

/** \\brief  1CB0, Alias Register, Group */
#define VADC_G6_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF0021CB0u)

/** Alias (User Manual Name) for VADC_G6_ALIAS.
* To use register names with standard convension, please use VADC_G6_ALIAS.
*/
#define	VADC_G6ALIAS	(VADC_G6_ALIAS)

/** \\brief  1C80, Arbitration Configuration Register, Group */
#define VADC_G6_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0021C80u)

/** Alias (User Manual Name) for VADC_G6_ARBCFG.
* To use register names with standard convension, please use VADC_G6_ARBCFG.
*/
#define	VADC_G6ARBCFG	(VADC_G6_ARBCFG)

/** \\brief  1C84, Arbitration Priority Register, Group */
#define VADC_G6_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0021C84u)

/** Alias (User Manual Name) for VADC_G6_ARBPR.
* To use register names with standard convension, please use VADC_G6_ARBPR.
*/
#define	VADC_G6ARBPR	(VADC_G6_ARBPR)

/** \\brief  1D20, Autoscan Source Control Register, Group */
#define VADC_G6_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0021D20u)

/** Alias (User Manual Name) for VADC_G6_ASCTRL.
* To use register names with standard convension, please use VADC_G6_ASCTRL.
*/
#define	VADC_G6ASCTRL	(VADC_G6_ASCTRL)

/** \\brief  1D24, Autoscan Source Mode Register, Group */
#define VADC_G6_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0021D24u)

/** Alias (User Manual Name) for VADC_G6_ASMR.
* To use register names with standard convension, please use VADC_G6_ASMR.
*/
#define	VADC_G6ASMR	(VADC_G6_ASMR)

/** \\brief  1D2C, Autoscan Source Pending Register, Group */
#define VADC_G6_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF0021D2Cu)

/** Alias (User Manual Name) for VADC_G6_ASPND.
* To use register names with standard convension, please use VADC_G6_ASPND.
*/
#define	VADC_G6ASPND	(VADC_G6_ASPND)

/** \\brief  1D28, Autoscan Source Channel Select Register, Group */
#define VADC_G6_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0021D28u)

/** Alias (User Manual Name) for VADC_G6_ASSEL.
* To use register names with standard convension, please use VADC_G6_ASSEL.
*/
#define	VADC_G6ASSEL	(VADC_G6_ASSEL)

