HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** \\brief  1CC8, Boundary Flag Register, Group */
#define VADC_G6_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF0021CC8u)

/** Alias (User Manual Name) for VADC_G6_BFL.
* To use register names with standard convension, please use VADC_G6_BFL.
*/
#define	VADC_G6BFL	(VADC_G6_BFL)

/** \\brief  1CD0, Boundary Flag Control Register, Group */
#define VADC_G6_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF0021CD0u)

/** Alias (User Manual Name) for VADC_G6_BFLC.
* To use register names with standard convension, please use VADC_G6_BFLC.
*/
#define	VADC_G6BFLC	(VADC_G6_BFLC)

/** \\brief  1CCC, Boundary Flag Software Register, Group */
#define VADC_G6_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF0021CCCu)

/** Alias (User Manual Name) for VADC_G6_BFLS.
* To use register names with standard convension, please use VADC_G6_BFLS.
*/
#define	VADC_G6BFLS	(VADC_G6_BFLS)

/** \\brief  1CB8, Boundary Select Register, Group */
#define VADC_G6_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF0021CB8u)

/** Alias (User Manual Name) for VADC_G6_BOUND.
* To use register names with standard convension, please use VADC_G6_BOUND.
*/
#define	VADC_G6BOUND	(VADC_G6_BOUND)

/** \\brief  1D90, Channel Event Flag Clear Register, Group */
#define VADC_G6_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0021D90u)

/** Alias (User Manual Name) for VADC_G6_CEFCLR.
* To use register names with standard convension, please use VADC_G6_CEFCLR.
*/
#define	VADC_G6CEFCLR	(VADC_G6_CEFCLR)

/** \\brief  1D80, Channel Event Flag Register, Group */
#define VADC_G6_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0021D80u)

/** Alias (User Manual Name) for VADC_G6_CEFLAG.
* To use register names with standard convension, please use VADC_G6_CEFLAG.
*/
#define	VADC_G6CEFLAG	(VADC_G6_CEFLAG)

/** \\brief  1DA0, Channel Event Node Pointer Register 0, Group */
#define VADC_G6_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF0021DA0u)

/** Alias (User Manual Name) for VADC_G6_CEVNP0.
* To use register names with standard convension, please use VADC_G6_CEVNP0.
*/
#define	VADC_G6CEVNP0	(VADC_G6_CEVNP0)

/** \\brief  1C88, Channel Assignment Register, Group */
#define VADC_G6_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0021C88u)

/** Alias (User Manual Name) for VADC_G6_CHASS.
* To use register names with standard convension, please use VADC_G6_CHASS.
*/
#define	VADC_G6CHASS	(VADC_G6_CHASS)

/** \\brief  1E00, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E00u)

/** Alias (User Manual Name) for VADC_G6_CHCTR0.
* To use register names with standard convension, please use VADC_G6_CHCTR0.
*/
#define	VADC_G6CHCTR0	(VADC_G6_CHCTR0)

/** \\brief  1E04, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E04u)

/** Alias (User Manual Name) for VADC_G6_CHCTR1.
* To use register names with standard convension, please use VADC_G6_CHCTR1.
*/
#define	VADC_G6CHCTR1	(VADC_G6_CHCTR1)







/** \\brief  1E08, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E08u)

/** Alias (User Manual Name) for VADC_G6_CHCTR2.
* To use register names with standard convension, please use VADC_G6_CHCTR2.
*/
#define	VADC_G6CHCTR2	(VADC_G6_CHCTR2)

/** \\brief  1E0C, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E0Cu)

/** Alias (User Manual Name) for VADC_G6_CHCTR3.
* To use register names with standard convension, please use VADC_G6_CHCTR3.
*/
#define	VADC_G6CHCTR3	(VADC_G6_CHCTR3)

/** \\brief  1E10, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E10u)

/** Alias (User Manual Name) for VADC_G6_CHCTR4.
* To use register names with standard convension, please use VADC_G6_CHCTR4.
*/
#define	VADC_G6CHCTR4	(VADC_G6_CHCTR4)

/** \\brief  1E14, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E14u)

/** Alias (User Manual Name) for VADC_G6_CHCTR5.
* To use register names with standard convension, please use VADC_G6_CHCTR5.
*/
#define	VADC_G6CHCTR5	(VADC_G6_CHCTR5)

/** \\brief  1E18, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E18u)

/** Alias (User Manual Name) for VADC_G6_CHCTR6.
* To use register names with standard convension, please use VADC_G6_CHCTR6.
*/
#define	VADC_G6CHCTR6	(VADC_G6_CHCTR6)

/** \\brief  1E1C, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0021E1Cu)

/** Alias (User Manual Name) for VADC_G6_CHCTR7.
* To use register names with standard convension, please use VADC_G6_CHCTR7.
*/
#define	VADC_G6CHCTR7	(VADC_G6_CHCTR7)



/** \\brief  1DF0, External Multiplexer Control Register, Group x */
#define VADC_G6_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF0021DF0u)

/** Alias (User Manual Name) for VADC_G6_EMUXCTR.
* To use register names with standard convension, please use VADC_G6_EMUXCTR.
*/
#define	VADC_G6EMUXCTR	(VADC_G6_EMUXCTR)

/** \\brief  1CA0, Input Class Register */
#define VADC_G6_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0021CA0u)

/** Alias (User Manual Name) for VADC_G6_ICLASS0.
* To use register names with standard convension, please use VADC_G6_ICLASS0.
*/
#define	VADC_G6ICLASS0	(VADC_G6_ICLASS0)

/** \\brief  1CA4, Input Class Register */
#define VADC_G6_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF0021CA4u)

/** Alias (User Manual Name) for VADC_G6_ICLASS1.
* To use register names with standard convension, please use VADC_G6_ICLASS1.
*/
#define	VADC_G6ICLASS1	(VADC_G6_ICLASS1)

/** \\brief  1D0C, Queue 0 Register 0, Group */
#define VADC_G6_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF0021D0Cu)

/** Alias (User Manual Name) for VADC_G6_Q0R0.
* To use register names with standard convension, please use VADC_G6_Q0R0.
*/
#define	VADC_G6Q0R0	(VADC_G6_Q0R0)

/** \\brief  1D10, Queue 0 Input Register, Group */
#define VADC_G6_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0021D10u)

/** Alias (User Manual Name) for VADC_G6_QBUR0.
* To use register names with standard convension, please use VADC_G6_QBUR0.
*/
#define	VADC_G6QBUR0	(VADC_G6_QBUR0)

