HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** \\brief  1D84, Result Event Flag Register, Group */
#define VADC_G6_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0021D84u)

/** Alias (User Manual Name) for VADC_G6_REFLAG.
* To use register names with standard convension, please use VADC_G6_REFLAG.
*/
#define	VADC_G6REFLAG	(VADC_G6_REFLAG)

/** \\brief  1F00, Group Result Register */
#define VADC_G6_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F00u)

/** Alias (User Manual Name) for VADC_G6_RES0.
* To use register names with standard convension, please use VADC_G6_RES0.
*/
#define	VADC_G6RES0	(VADC_G6_RES0)

/** \\brief  1F04, Group Result Register */
#define VADC_G6_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F04u)

/** Alias (User Manual Name) for VADC_G6_RES1.
* To use register names with standard convension, please use VADC_G6_RES1.
*/
#define	VADC_G6RES1	(VADC_G6_RES1)

/** \\brief  1F28, Group Result Register */
#define VADC_G6_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F28u)

/** Alias (User Manual Name) for VADC_G6_RES10.
* To use register names with standard convension, please use VADC_G6_RES10.
*/
#define	VADC_G6RES10	(VADC_G6_RES10)

/** \\brief  1F2C, Group Result Register */
#define VADC_G6_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F2Cu)

/** Alias (User Manual Name) for VADC_G6_RES11.
* To use register names with standard convension, please use VADC_G6_RES11.
*/
#define	VADC_G6RES11	(VADC_G6_RES11)

/** \\brief  1F30, Group Result Register */
#define VADC_G6_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F30u)

/** Alias (User Manual Name) for VADC_G6_RES12.
* To use register names with standard convension, please use VADC_G6_RES12.
*/
#define	VADC_G6RES12	(VADC_G6_RES12)

/** \\brief  1F34, Group Result Register */
#define VADC_G6_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F34u)

/** Alias (User Manual Name) for VADC_G6_RES13.
* To use register names with standard convension, please use VADC_G6_RES13.
*/
#define	VADC_G6RES13	(VADC_G6_RES13)

/** \\brief  1F38, Group Result Register */
#define VADC_G6_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F38u)

/** Alias (User Manual Name) for VADC_G6_RES14.
* To use register names with standard convension, please use VADC_G6_RES14.
*/
#define	VADC_G6RES14	(VADC_G6_RES14)

/** \\brief  1F3C, Group Result Register */
#define VADC_G6_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F3Cu)

/** Alias (User Manual Name) for VADC_G6_RES15.
* To use register names with standard convension, please use VADC_G6_RES15.
*/
#define	VADC_G6RES15	(VADC_G6_RES15)

/** \\brief  1F08, Group Result Register */
#define VADC_G6_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F08u)

/** Alias (User Manual Name) for VADC_G6_RES2.
* To use register names with standard convension, please use VADC_G6_RES2.
*/
#define	VADC_G6RES2	(VADC_G6_RES2)

/** \\brief  1F0C, Group Result Register */
#define VADC_G6_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F0Cu)

/** Alias (User Manual Name) for VADC_G6_RES3.
* To use register names with standard convension, please use VADC_G6_RES3.
*/
#define	VADC_G6RES3	(VADC_G6_RES3)

/** \\brief  1F10, Group Result Register */
#define VADC_G6_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F10u)

/** Alias (User Manual Name) for VADC_G6_RES4.
* To use register names with standard convension, please use VADC_G6_RES4.
*/
#define	VADC_G6RES4	(VADC_G6_RES4)

/** \\brief  1F14, Group Result Register */
#define VADC_G6_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F14u)

/** Alias (User Manual Name) for VADC_G6_RES5.
* To use register names with standard convension, please use VADC_G6_RES5.
*/
#define	VADC_G6RES5	(VADC_G6_RES5)

/** \\brief  1F18, Group Result Register */
#define VADC_G6_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F18u)

/** Alias (User Manual Name) for VADC_G6_RES6.
* To use register names with standard convension, please use VADC_G6_RES6.
*/
#define	VADC_G6RES6	(VADC_G6_RES6)

/** \\brief  1F1C, Group Result Register */
#define VADC_G6_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F1Cu)

/** Alias (User Manual Name) for VADC_G6_RES7.
* To use register names with standard convension, please use VADC_G6_RES7.
*/
#define	VADC_G6RES7	(VADC_G6_RES7)

/** \\brief  1F20, Group Result Register */
#define VADC_G6_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F20u)

/** Alias (User Manual Name) for VADC_G6_RES8.
* To use register names with standard convension, please use VADC_G6_RES8.
*/
#define	VADC_G6RES8	(VADC_G6_RES8)

/** \\brief  1F24, Group Result Register */
#define VADC_G6_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0021F24u)

/** Alias (User Manual Name) for VADC_G6_RES9.
* To use register names with standard convension, please use VADC_G6_RES9.
*/
#define	VADC_G6RES9	(VADC_G6_RES9)

/** \\brief  1F80, Group Result Reg., Debug */
#define VADC_G6_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F80u)

/** Alias (User Manual Name) for VADC_G6_RESD0.
* To use register names with standard convension, please use VADC_G6_RESD0.
*/
#define	VADC_G6RESD0	(VADC_G6_RESD0)

/** \\brief  1F84, Group Result Reg., Debug */
#define VADC_G6_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021F84u)

/** Alias (User Manual Name) for VADC_G6_RESD1.
* To use register names with standard convension, please use VADC_G6_RESD1.
*/
#define	VADC_G6RESD1	(VADC_G6_RESD1)

/** \\brief  1FA8, Group Result Reg., Debug */
#define VADC_G6_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FA8u)

/** Alias (User Manual Name) for VADC_G6_RESD10.
* To use register names with standard convension, please use VADC_G6_RESD10.
*/
#define	VADC_G6RESD10	(VADC_G6_RESD10)

/** \\brief  1FAC, Group Result Reg., Debug */
#define VADC_G6_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FACu)

/** Alias (User Manual Name) for VADC_G6_RESD11.
* To use register names with standard convension, please use VADC_G6_RESD11.
*/
#define	VADC_G6RESD11	(VADC_G6_RESD11)

/** \\brief  1FB0, Group Result Reg., Debug */
#define VADC_G6_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FB0u)

/** Alias (User Manual Name) for VADC_G6_RESD12.
* To use register names with standard convension, please use VADC_G6_RESD12.
*/
#define	VADC_G6RESD12	(VADC_G6_RESD12)

/** \\brief  1FB4, Group Result Reg., Debug */
#define VADC_G6_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FB4u)

/** Alias (User Manual Name) for VADC_G6_RESD13.
* To use register names with standard convension, please use VADC_G6_RESD13.
*/
#define	VADC_G6RESD13	(VADC_G6_RESD13)

/** \\brief  1FB8, Group Result Reg., Debug */
#define VADC_G6_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0021FB8u)

