HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_ASCTRL.
* To use register names with standard convension, please use VADC_G7_ASCTRL.
*/
#define	VADC_G7ASCTRL	(VADC_G7_ASCTRL)

/** \\brief  2124, Autoscan Source Mode Register, Group */
#define VADC_G7_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0022124u)

/** Alias (User Manual Name) for VADC_G7_ASMR.
* To use register names with standard convension, please use VADC_G7_ASMR.
*/
#define	VADC_G7ASMR	(VADC_G7_ASMR)

/** \\brief  212C, Autoscan Source Pending Register, Group */
#define VADC_G7_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002212Cu)

/** Alias (User Manual Name) for VADC_G7_ASPND.
* To use register names with standard convension, please use VADC_G7_ASPND.
*/
#define	VADC_G7ASPND	(VADC_G7_ASPND)

/** \\brief  2128, Autoscan Source Channel Select Register, Group */
#define VADC_G7_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0022128u)

/** Alias (User Manual Name) for VADC_G7_ASSEL.
* To use register names with standard convension, please use VADC_G7_ASSEL.
*/
#define	VADC_G7ASSEL	(VADC_G7_ASSEL)

/** \\brief  20C8, Boundary Flag Register, Group */
#define VADC_G7_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00220C8u)

/** Alias (User Manual Name) for VADC_G7_BFL.
* To use register names with standard convension, please use VADC_G7_BFL.
*/
#define	VADC_G7BFL	(VADC_G7_BFL)

/** \\brief  20D0, Boundary Flag Control Register, Group */
#define VADC_G7_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00220D0u)

/** Alias (User Manual Name) for VADC_G7_BFLC.
* To use register names with standard convension, please use VADC_G7_BFLC.
*/
#define	VADC_G7BFLC	(VADC_G7_BFLC)

/** \\brief  20CC, Boundary Flag Software Register, Group */
#define VADC_G7_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00220CCu)

/** Alias (User Manual Name) for VADC_G7_BFLS.
* To use register names with standard convension, please use VADC_G7_BFLS.
*/
#define	VADC_G7BFLS	(VADC_G7_BFLS)

/** \\brief  20B8, Boundary Select Register, Group */
#define VADC_G7_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00220B8u)

/** Alias (User Manual Name) for VADC_G7_BOUND.
* To use register names with standard convension, please use VADC_G7_BOUND.
*/
#define	VADC_G7BOUND	(VADC_G7_BOUND)

/** \\brief  2190, Channel Event Flag Clear Register, Group */
#define VADC_G7_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022190u)

/** Alias (User Manual Name) for VADC_G7_CEFCLR.
* To use register names with standard convension, please use VADC_G7_CEFCLR.
*/
#define	VADC_G7CEFCLR	(VADC_G7_CEFCLR)

/** \\brief  2180, Channel Event Flag Register, Group */
#define VADC_G7_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022180u)

/** Alias (User Manual Name) for VADC_G7_CEFLAG.
* To use register names with standard convension, please use VADC_G7_CEFLAG.
*/
#define	VADC_G7CEFLAG	(VADC_G7_CEFLAG)

/** \\brief  21A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G7_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00221A0u)

/** Alias (User Manual Name) for VADC_G7_CEVNP0.
* To use register names with standard convension, please use VADC_G7_CEVNP0.
*/
#define	VADC_G7CEVNP0	(VADC_G7_CEVNP0)

/** \\brief  2088, Channel Assignment Register, Group */
#define VADC_G7_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022088u)

/** Alias (User Manual Name) for VADC_G7_CHASS.
* To use register names with standard convension, please use VADC_G7_CHASS.
*/
#define	VADC_G7CHASS	(VADC_G7_CHASS)

/** \\brief  2200, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022200u)

/** Alias (User Manual Name) for VADC_G7_CHCTR0.
* To use register names with standard convension, please use VADC_G7_CHCTR0.
*/
#define	VADC_G7CHCTR0	(VADC_G7_CHCTR0)

/** \\brief  2204, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022204u)

/** Alias (User Manual Name) for VADC_G7_CHCTR1.
* To use register names with standard convension, please use VADC_G7_CHCTR1.
*/
#define	VADC_G7CHCTR1	(VADC_G7_CHCTR1)







/** \\brief  2208, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022208u)

/** Alias (User Manual Name) for VADC_G7_CHCTR2.
* To use register names with standard convension, please use VADC_G7_CHCTR2.
*/
#define	VADC_G7CHCTR2	(VADC_G7_CHCTR2)

/** \\brief  220C, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002220Cu)

/** Alias (User Manual Name) for VADC_G7_CHCTR3.
* To use register names with standard convension, please use VADC_G7_CHCTR3.
*/
#define	VADC_G7CHCTR3	(VADC_G7_CHCTR3)

/** \\brief  2210, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022210u)

/** Alias (User Manual Name) for VADC_G7_CHCTR4.
* To use register names with standard convension, please use VADC_G7_CHCTR4.
*/
#define	VADC_G7CHCTR4	(VADC_G7_CHCTR4)

/** \\brief  2214, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022214u)

/** Alias (User Manual Name) for VADC_G7_CHCTR5.
* To use register names with standard convension, please use VADC_G7_CHCTR5.
*/
#define	VADC_G7CHCTR5	(VADC_G7_CHCTR5)

/** \\brief  2218, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF0022218u)

/** Alias (User Manual Name) for VADC_G7_CHCTR6.
* To use register names with standard convension, please use VADC_G7_CHCTR6.
*/
#define	VADC_G7CHCTR6	(VADC_G7_CHCTR6)

/** \\brief  221C, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_CHCTR*)0xF002221Cu)

/** Alias (User Manual Name) for VADC_G7_CHCTR7.
* To use register names with standard convension, please use VADC_G7_CHCTR7.
*/
#define	VADC_G7CHCTR7	(VADC_G7_CHCTR7)



/** \\brief  21F0, External Multiplexer Control Register, Group x */
#define VADC_G7_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00221F0u)

/** Alias (User Manual Name) for VADC_G7_EMUXCTR.
* To use register names with standard convension, please use VADC_G7_EMUXCTR.
*/
#define	VADC_G7EMUXCTR	(VADC_G7_EMUXCTR)

/** \\brief  20A0, Input Class Register */
#define VADC_G7_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00220A0u)

