HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_RES1.
* To use register names with standard convension, please use VADC_G7_RES1.
*/
#define	VADC_G7RES1	(VADC_G7_RES1)

/** \\brief  2328, Group Result Register */
#define VADC_G7_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022328u)

/** Alias (User Manual Name) for VADC_G7_RES10.
* To use register names with standard convension, please use VADC_G7_RES10.
*/
#define	VADC_G7RES10	(VADC_G7_RES10)

/** \\brief  232C, Group Result Register */
#define VADC_G7_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002232Cu)

/** Alias (User Manual Name) for VADC_G7_RES11.
* To use register names with standard convension, please use VADC_G7_RES11.
*/
#define	VADC_G7RES11	(VADC_G7_RES11)

/** \\brief  2330, Group Result Register */
#define VADC_G7_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022330u)

/** Alias (User Manual Name) for VADC_G7_RES12.
* To use register names with standard convension, please use VADC_G7_RES12.
*/
#define	VADC_G7RES12	(VADC_G7_RES12)

/** \\brief  2334, Group Result Register */
#define VADC_G7_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022334u)

/** Alias (User Manual Name) for VADC_G7_RES13.
* To use register names with standard convension, please use VADC_G7_RES13.
*/
#define	VADC_G7RES13	(VADC_G7_RES13)

/** \\brief  2338, Group Result Register */
#define VADC_G7_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022338u)

/** Alias (User Manual Name) for VADC_G7_RES14.
* To use register names with standard convension, please use VADC_G7_RES14.
*/
#define	VADC_G7RES14	(VADC_G7_RES14)

/** \\brief  233C, Group Result Register */
#define VADC_G7_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002233Cu)

/** Alias (User Manual Name) for VADC_G7_RES15.
* To use register names with standard convension, please use VADC_G7_RES15.
*/
#define	VADC_G7RES15	(VADC_G7_RES15)

/** \\brief  2308, Group Result Register */
#define VADC_G7_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022308u)

/** Alias (User Manual Name) for VADC_G7_RES2.
* To use register names with standard convension, please use VADC_G7_RES2.
*/
#define	VADC_G7RES2	(VADC_G7_RES2)

/** \\brief  230C, Group Result Register */
#define VADC_G7_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002230Cu)

/** Alias (User Manual Name) for VADC_G7_RES3.
* To use register names with standard convension, please use VADC_G7_RES3.
*/
#define	VADC_G7RES3	(VADC_G7_RES3)

/** \\brief  2310, Group Result Register */
#define VADC_G7_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022310u)

/** Alias (User Manual Name) for VADC_G7_RES4.
* To use register names with standard convension, please use VADC_G7_RES4.
*/
#define	VADC_G7RES4	(VADC_G7_RES4)

/** \\brief  2314, Group Result Register */
#define VADC_G7_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022314u)

/** Alias (User Manual Name) for VADC_G7_RES5.
* To use register names with standard convension, please use VADC_G7_RES5.
*/
#define	VADC_G7RES5	(VADC_G7_RES5)

/** \\brief  2318, Group Result Register */
#define VADC_G7_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022318u)

/** Alias (User Manual Name) for VADC_G7_RES6.
* To use register names with standard convension, please use VADC_G7_RES6.
*/
#define	VADC_G7RES6	(VADC_G7_RES6)

/** \\brief  231C, Group Result Register */
#define VADC_G7_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF002231Cu)

/** Alias (User Manual Name) for VADC_G7_RES7.
* To use register names with standard convension, please use VADC_G7_RES7.
*/
#define	VADC_G7RES7	(VADC_G7_RES7)

/** \\brief  2320, Group Result Register */
#define VADC_G7_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022320u)

/** Alias (User Manual Name) for VADC_G7_RES8.
* To use register names with standard convension, please use VADC_G7_RES8.
*/
#define	VADC_G7RES8	(VADC_G7_RES8)

/** \\brief  2324, Group Result Register */
#define VADC_G7_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_RES*)0xF0022324u)

/** Alias (User Manual Name) for VADC_G7_RES9.
* To use register names with standard convension, please use VADC_G7_RES9.
*/
#define	VADC_G7RES9	(VADC_G7_RES9)

/** \\brief  2380, Group Result Reg., Debug */
#define VADC_G7_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022380u)

/** Alias (User Manual Name) for VADC_G7_RESD0.
* To use register names with standard convension, please use VADC_G7_RESD0.
*/
#define	VADC_G7RESD0	(VADC_G7_RESD0)

/** \\brief  2384, Group Result Reg., Debug */
#define VADC_G7_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022384u)

/** Alias (User Manual Name) for VADC_G7_RESD1.
* To use register names with standard convension, please use VADC_G7_RESD1.
*/
#define	VADC_G7RESD1	(VADC_G7_RESD1)

/** \\brief  23A8, Group Result Reg., Debug */
#define VADC_G7_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00223A8u)

/** Alias (User Manual Name) for VADC_G7_RESD10.
* To use register names with standard convension, please use VADC_G7_RESD10.
*/
#define	VADC_G7RESD10	(VADC_G7_RESD10)

/** \\brief  23AC, Group Result Reg., Debug */
#define VADC_G7_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00223ACu)

/** Alias (User Manual Name) for VADC_G7_RESD11.
* To use register names with standard convension, please use VADC_G7_RESD11.
*/
#define	VADC_G7RESD11	(VADC_G7_RESD11)

/** \\brief  23B0, Group Result Reg., Debug */
#define VADC_G7_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00223B0u)

/** Alias (User Manual Name) for VADC_G7_RESD12.
* To use register names with standard convension, please use VADC_G7_RESD12.
*/
#define	VADC_G7RESD12	(VADC_G7_RESD12)

/** \\brief  23B4, Group Result Reg., Debug */
#define VADC_G7_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00223B4u)

/** Alias (User Manual Name) for VADC_G7_RESD13.
* To use register names with standard convension, please use VADC_G7_RESD13.
*/
#define	VADC_G7RESD13	(VADC_G7_RESD13)

/** \\brief  23B8, Group Result Reg., Debug */
#define VADC_G7_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00223B8u)

/** Alias (User Manual Name) for VADC_G7_RESD14.
* To use register names with standard convension, please use VADC_G7_RESD14.
*/
#define	VADC_G7RESD14	(VADC_G7_RESD14)

/** \\brief  23BC, Group Result Reg., Debug */
#define VADC_G7_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF00223BCu)

/** Alias (User Manual Name) for VADC_G7_RESD15.
* To use register names with standard convension, please use VADC_G7_RESD15.
*/
#define	VADC_G7RESD15	(VADC_G7_RESD15)

/** \\brief  2388, Group Result Reg., Debug */
#define VADC_G7_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022388u)

/** Alias (User Manual Name) for VADC_G7_RESD2.
* To use register names with standard convension, please use VADC_G7_RESD2.
*/
#define	VADC_G7RESD2	(VADC_G7_RESD2)

/** \\brief  238C, Group Result Reg., Debug */
#define VADC_G7_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF002238Cu)

/** Alias (User Manual Name) for VADC_G7_RESD3.
* To use register names with standard convension, please use VADC_G7_RESD3.
*/
#define	VADC_G7RESD3	(VADC_G7_RESD3)

/** \\brief  2390, Group Result Reg., Debug */
#define VADC_G7_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022390u)

/** Alias (User Manual Name) for VADC_G7_RESD4.
* To use register names with standard convension, please use VADC_G7_RESD4.
*/
#define	VADC_G7RESD4	(VADC_G7_RESD4)

/** \\brief  2394, Group Result Reg., Debug */
#define VADC_G7_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_RESD*)0xF0022394u)

